import type { Intervention } from "@/lib/types";

export const mockInterventions: Intervention[] = [
  {
    id: '1',
    info: '(1)Ανώτατο όριο δαπάνης ανεξαρτήτως συντελεστή θερμοπερατότητας U. Για την καταχώρηση δαπάνης απαιτείται η αναβάθμιση του συνόλου των αδιαφανών στοιχείων του κελύφους που είναι σε επαφή με μη θερμαινόμενους χώρους ή εξωτερικό αέρα.',
    energyChar: '0 < P <= 100',
    expenseCategory: 'I Μη κεντρικά',
    category: 'Εξοικονόμηση Ενέργειας',
    code: '1.A1',
    unit: 'm²',
    maxCostPerUnit: 120,
    maxAmount: 12000,
    subCategory: 'Θερμομόνωση κελύφους συμπεριλαμβανομένου του δώματος / στέγης και της πιλοτής',
  },
  {
    id: '2',
    info: '(2)Ανώτατο όριο δαπάνης ανεξαρτήτως συντελεστή θερμοπερατότητας U. Για την καταχώρηση δαπάνης απαιτείται η αντικατάσταση του συνόλου των εξωτερικών κουφωμάτων.',
    energyChar: '100 < P <= 200',
    expenseCategory: 'I Μη κεντρικά',
    category: 'Εξοικονόμηση Ενέργειας',
    code: '1.B2',
    unit: 'm²',
    maxCostPerUnit: 454,
    maxAmount: 22700,
    subCategory: 'Αντικατάσταση Κουφωμάτων',
  },
  {
    id: '3',
    info: '(3)Ανώτατο όριο δαπάνης. Για την καταχώρηση δαπάνης απαιτείται η εγκατάσταση νέου συστήματος.',
    energyChar: 'P > 200',
    expenseCategory: 'II Κεντρικά',
    category: 'ΑΠΕ',
    code: '1.C1',
    unit: 'kW',
    maxCostPerUnit: 1500,
    maxAmount: 15000,
    subCategory: 'Σύστημα παραγωγής ζεστού νερού χρήσης (ΖΝΧ) με χρήση Ανανεώσιμων Πηγών Ενέργειας (ΑΠΕ)',
  }
];
